SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/protocol_config/efr32xg26/ble_efr32xg26_configurator_out.c
/***************************************************************************//**
 * @brief RAIL Configuration
 * @details
 *   WARNING: Auto-Generated Radio Config  -  DO NOT EDIT
 *   Radio Configurator Version: 2504.1.1 (a165f360ce)
 *   RAIL Adapter Version: 2.4.33 (14b7437903)
 *   RAIL Compatibility: 2.x
 *******************************************************************************
 * # License
 * <b>Copyright 2025 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/
#include "em_device.h"
#include "ble_efr32xg26_configurator_out.h"

static const uint8_t irCalConfig_0[] = {
  25, 63, 1, 6, 4, 16, 1, 0, 0, 1, 1, 6, 0, 16, 39, 0, 0, 12, 0, 0, 0, 0, 0, 0, 0, 0
};

static const uint8_t irCalConfig_1[] = {
  25, 63, 1, 6, 4, 16, 1, 0, 0, 1, 1, 6, 0, 16, 39, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0
};

static const int32_t timingConfig_0[] = {
  50000, 11250, 750, 750
};

static const int32_t timingConfig_1[] = {
  50000, 5750, 375, 375
};

static const int32_t timingConfig_2[] = {
  187125, 8100, 400, 400
};

static const int32_t timingConfig_3[] = {
  49125, 9000, 875, 875
};

static const int32_t timingConfig_4[] = {
  50000, 11750, 2000, 2000
};

static const uint8_t hfxoRetimingConfigEntries[] = {
  2, 0, 0, 0, 0xc0, 0x17, 0x53, 0x02, 6, 20, 0, 0, 0x80, 0x2f, 0xa6, 0x04, 5, 56, 0, 0, 0xa0, 0x08, 0, 0, 0, 0, 0x58, 0x09, 1, 4, 7, 6, 0x10, 0x0a, 1, 4, 7, 7, 0xc8, 0x0a, 0, 4, 8, 7, 0x80, 0x0b, 0, 4, 8, 8, 0x38, 0x0c, 0, 4, 9, 8, 0x61, 0x08, 0, 0, 0, 0, 0x8a, 0x08, 0, 0, 0, 0, 0xc7, 0x09, 1, 4, 4, 3, 0x2c, 0x0b, 1, 4, 4, 4, 0x92, 0x0c, 1, 4, 5, 4
};

#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
static const uint8_t stackInfo_0[2] = { 0x03, 0x0a };
static const uint8_t stackInfo_1[2] = { 0x03, 0x02 };
static const uint8_t stackInfo_2[2] = { 0x03, 0x08 };
static const uint8_t stackInfo_3[2] = { 0x03, 0x03 };
static const uint8_t stackInfo_4[2] = { 0x03, 0x04 };
static const uint8_t stackInfo_5[2] = { 0x03, 0x05 };
#endif // RADIO_CONFIG_ENABLE_STACK_INFO

static RAIL_ChannelConfigEntryAttr_t channelConfigEntryAttr_0 = {
#if RAIL_SUPPORTS_OFDM_PA
  {
#ifdef RADIO_CONFIG_ENABLE_IRCAL_MULTIPLE_RF_PATHS
    { 0xFFFFFFFFUL, 0xFFFFFFFFUL, },
#else
    { 0xFFFFFFFFUL },
#endif // RADIO_CONFIG_ENABLE_IRCAL_MULTIPLE_RF_PATHS
    { 0xFFFFFFFFUL, 0xFFFFFFFFUL }
  }
#else // RAIL_SUPPORTS_OFDM_PA
#ifdef RADIO_CONFIG_ENABLE_IRCAL_MULTIPLE_RF_PATHS
  { 0xFFFFFFFFUL, 0xFFFFFFFFUL, },
#else
  { 0xFFFFFFFFUL },
#endif // RADIO_CONFIG_ENABLE_IRCAL_MULTIPLE_RF_PATHS
#endif // RAIL_SUPPORTS_OFDM_PA
};

static RAIL_ChannelConfigEntryAttr_t channelConfigEntryAttr_1 = {
#if RAIL_SUPPORTS_OFDM_PA
  {
#ifdef RADIO_CONFIG_ENABLE_IRCAL_MULTIPLE_RF_PATHS
    { 0xFFFFFFFFUL, 0xFFFFFFFFUL, },
#else
    { 0xFFFFFFFFUL },
#endif // RADIO_CONFIG_ENABLE_IRCAL_MULTIPLE_RF_PATHS
    { 0xFFFFFFFFUL, 0xFFFFFFFFUL }
  }
#else // RAIL_SUPPORTS_OFDM_PA
#ifdef RADIO_CONFIG_ENABLE_IRCAL_MULTIPLE_RF_PATHS
  { 0xFFFFFFFFUL, 0xFFFFFFFFUL, },
#else
  { 0xFFFFFFFFUL },
#endif // RADIO_CONFIG_ENABLE_IRCAL_MULTIPLE_RF_PATHS
#endif // RAIL_SUPPORTS_OFDM_PA
};

static const uint32_t phyInfo_0[] = {
  20UL,
  0x00924924UL, // 146.28571428571428
  (uint32_t) NULL,
  (uint32_t) irCalConfig_0,
  (uint32_t) timingConfig_0,
  0x00000000UL,
  0UL,
  16000000UL,
  1000000UL,
  0x00F80101UL,
  0x035024C2UL,
  (uint32_t) NULL,
  (uint32_t) hfxoRetimingConfigEntries,
  (uint32_t) NULL,
  0UL,
  0UL,
  999979UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) 0UL,
};

static const uint32_t phyInfo_1[] = {
  20UL,
  0x00666666UL, // 102.39999999999999
  (uint32_t) NULL,
  (uint32_t) irCalConfig_0,
  (uint32_t) timingConfig_1,
  0x00000000UL,
  0UL,
  32000000UL,
  2000000UL,
  0x00F80101UL,
  0x025047F1UL,
  (uint32_t) NULL,
  (uint32_t) hfxoRetimingConfigEntries,
  (uint32_t) NULL,
  0UL,
  0UL,
  1999996UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) 0UL,
};

static const uint32_t phyInfo_2[] = {
  20UL,
  0x0071C71CUL, // 113.77777777777776
  (uint32_t) NULL,
  (uint32_t) irCalConfig_1,
  (uint32_t) timingConfig_2,
  0x00000000UL,
  0UL,
  36000000UL,
  1000000UL,
  0x00F60801UL,
  0x021047F1UL,
  (uint32_t) NULL,
  (uint32_t) hfxoRetimingConfigEntries,
  (uint32_t) NULL,
  0UL,
  0UL,
  999978UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) 0UL,
};

static const uint32_t phyInfo_3[] = {
  20UL,
  0x0071C71CUL, // 113.77777777777776
  (uint32_t) NULL,
  (uint32_t) irCalConfig_1,
  (uint32_t) timingConfig_3,
  0x00000000UL,
  0UL,
  36000000UL,
  1000000UL,
  0x00F60201UL,
  0x021047F1UL,
  (uint32_t) NULL,
  (uint32_t) hfxoRetimingConfigEntries,
  (uint32_t) NULL,
  0UL,
  0UL,
  999978UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) 0UL,
};

static const uint32_t phyInfo_4[] = {
  20UL,
  0x0071C71CUL, // 113.77777777777776
  (uint32_t) NULL,
  (uint32_t) irCalConfig_1,
  (uint32_t) timingConfig_4,
  0x00000000UL,
  0UL,
  36000000UL,
  1000000UL,
  0x00F60801UL,
  0x021047F1UL,
  (uint32_t) NULL,
  (uint32_t) hfxoRetimingConfigEntries,
  (uint32_t) NULL,
  0UL,
  0UL,
  999978UL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) NULL,
  (uint32_t) 0UL,
};

const uint32_t ble_viterbi1M_modemConfigBase[] = {
  0x0001400CUL, 0x00018101UL, /* Write: FRC.DFLCTRL */
  0x00024020UL, 0x00000000UL, /* Write: FRC.WCNTCMP0 */
  /*    4024 */ 0x00000001UL, /* FRC.WCNTCMP1 */
  0x00034030UL, 0x00000000UL, /* Write: FRC.WHITECTRL */
  /*    4034 */ 0x00000000UL, /* FRC.WHITEPOLY */
  /*    4038 */ 0x00000000UL, /* FRC.WHITEINIT */
  0x00024040UL, 0x00000000UL, /* Write: FRC.BLOCKRAMADDR */
  /*    4044 */ 0x00004000UL, /* FRC.CONVRAMADDR */
  0x00014060UL, 0x00000101UL, /* Write: FRC.PUNCTCTRL */
  0x000140A8UL, 0x00000007UL, /* Write: FRC.AUTOCG */
  0x000440BCUL, 0x00000000UL, /* Write: FRC.WCNTCMP3 */
  /*    40C0 */ 0x00000000UL, /* FRC.BOICTRL */
  /*    40C4 */ 0x00000000UL, /* FRC.DSLCTRL */
  /*    40C8 */ 0x00000000UL, /* FRC.WCNTCMP4 */
  0x0003410CUL, 0x00004CFFUL, /* Write: FRC.FCD1 */
  /*    4110 */ 0x00004DFFUL, /* FRC.FCD2 */
  /*    4114 */ 0x00004DFFUL, /* FRC.FCD3 */
  0x1001C020UL, 0x0007F800UL, /* AND: AGC.CTRL0 */
  0x3001C020UL, 0x012802F5UL, /* OR: AGC.CTRL0 */
  0x1001C024UL, 0x000000FFUL, /* AND: AGC.CTRL1 */
  0x3001C024UL, 0x00001300UL, /* OR: AGC.CTRL1 */
  0x0008C028UL, 0x03B380ECUL, /* Write: AGC.CTRL2 */
  /*    C02C */ 0x51407543UL, /* AGC.CTRL3 */
  /*    C030 */ 0xF8000FA0UL, /* AGC.CTRL4 */
  /*    C034 */ 0x00004000UL, /* AGC.CTRL5 */
  /*    C038 */ 0x0007AAA8UL, /* AGC.CTRL6 */
  /*    C03C */ 0x00000000UL, /* AGC.CTRL7 */
  /*    C040 */ 0x00000000UL, /* AGC.RSSISTEPTHR */
  /*    C044 */ 0x00000000UL, /* AGC.MANGAIN */
  0x0009C070UL, 0x000010BAUL, /* Write: AGC.GAINSTEPLIM1 */
  /*    C074 */ 0x00200400UL, /* AGC.PNRFATT0 */
  /*    C078 */ 0x00801804UL, /* AGC.PNRFATT1 */
  /*    C07C */ 0x01203C0BUL, /* AGC.PNRFATT2 */
  /*    C080 */ 0x02107C18UL, /* AGC.PNRFATT3 */
  /*    C084 */ 0x06E0FC2FUL, /* AGC.PNRFATT4 */
  /*    C088 */ 0x0000007FUL, /* AGC.PNRFATT5 */
  /*    C08C */ 0x00000000UL, /* AGC.PNRFATT6 */
  /*    C090 */ 0x00000000UL, /* AGC.PNRFATT7 */
  0x0005C0A8UL, 0x15724BBDUL, /* Write: AGC.LNAMIXCODE0 */
  /*    C0AC */ 0x0518A311UL, /* AGC.LNAMIXCODE1 */
  /*    C0B0 */ 0x76543210UL, /* AGC.PGACODE0 */
  /*    C0B4 */ 0x00000A98UL, /* AGC.PGACODE1 */
  /*    C0B8 */ 0x00000000UL, /* AGC.LBT */
  0x0004C0CCUL, 0x00000001UL, /* Write: AGC.LNABOOST */
  /*    C0D0 */ 0x00000000UL, /* AGC.ANTDIV */
  /*    C0D4 */ 0x000A0001UL, /* AGC.DUALRFPKDTHD0 */
  /*    C0D8 */ 0x00280001UL, /* AGC.DUALRFPKDTHD1 */
  0x01010008UL, 0x00000708UL, /* Write: RFCRC.CTRL */
  0x01010018UL, 0x00AAAAAAUL, /* Write: RFCRC.INIT */
  0x01010020UL, 0x00DA6000UL, /* Write: RFCRC.POLY */
  0x0102405CUL, 0x03000000UL, /* Write: MODEM.CTRL4 */
  /*    4060 */ 0x20000000UL, /* MODEM.CTRL5 */
  0x01044078UL, 0x71764129UL, /* Write: MODEM.SYNC0 */
  /*    407C */ 0x00000000UL, /* MODEM.SYNC1 */
  /*    4080 */ 0x000C008CUL, /* MODEM.TIMING */
  /*    4084 */ 0x00000000UL, /* MODEM.DSSS0 */
  0x010440C4UL, 0x00000000UL, /* Write: MODEM.SHAPING12 */
  /*    40C8 */ 0x00000000UL, /* MODEM.SHAPING13 */
  /*    40CC */ 0x00000000UL, /* MODEM.SHAPING14 */
  /*    40D0 */ 0x00000000UL, /* MODEM.SHAPING15 */
  0x010140E0UL, 0x00000200UL, /* Write: MODEM.ANARAMPCTRL */
  0x01024110UL, 0x00051E33UL, /* Write: MODEM.DCCOMP */
  /*    4114 */ 0x00000000UL, /* MODEM.DCCOMPFILTINIT */
  0x01074120UL, 0x00000000UL, /* Write: MODEM.INTAFC */
  /*    4124 */ 0x078304FFUL, /* MODEM.DSATHD0 */
  /*    4128 */ 0x3AC81388UL, /* MODEM.DSATHD1 */
  /*    412C */ 0x0C6606FFUL, /* MODEM.DSATHD2 */
  /*    4130 */ 0x078304FFUL, /* MODEM.DSATHD3 */
  /*    4134 */ 0x03FF1388UL, /* MODEM.DSATHD4 */
  /*    4138 */ 0xF00A20BCUL, /* MODEM.DSACTRL */
  0x01014158UL, 0x00000000UL, /* Write: MODEM.AUTOCG */
  0x01014164UL, 0x0000010CUL, /* Write: MODEM.DIRECTMODE */
  0x01054184UL, 0x00000101UL, /* Write: MODEM.LRFRC */
  /*    4188 */ 0x00000000UL, /* MODEM.COH0 */
  /*    418C */ 0x00000000UL, /* MODEM.COH1 */
  /*    4190 */ 0x00000000UL, /* MODEM.COH2 */
  /*    4194 */ 0x00000000UL, /* MODEM.COH3 */
  0x010241A4UL, 0x00000000UL, /* Write: MODEM.SYNCPROPERTIES */
  /*    41A8 */ 0x00000000UL, /* MODEM.DIGIGAINCTRL */
  0x010241B0UL, 0x00000000UL, /* Write: MODEM.PADEBUG */
  /*    41B4 */ 0xC03E9258UL, /* MODEM.REALTIMCFE */
  0x010341BCUL, 0x00000000UL, /* Write: MODEM.ETSTIM */
  /*    41C0 */ 0x003C0000UL, /* MODEM.ANTSWCTRL */
  /*    41C4 */ 0x00069069UL, /* MODEM.ANTSWCTRL1 */
  0x0103422CUL, 0x40001860UL, /* Write: MODEM.RXRESTART */
  /*    4230 */ 0x00000000UL, /* MODEM.SQ */
  /*    4234 */ 0x00000000UL, /* MODEM.SQEXT */
  0x0101423CUL, 0x00000000UL, /* Write: MODEM.ANTDIVCTRL */
  0x01024244UL, 0x00000014UL, /* Write: MODEM.PHDMODANTDIV */
  /*    4248 */ 0x00000000UL, /* MODEM.PHANTDECSION */
  0x01024280UL, 0x00000000UL, /* Write: MODEM.ADCTRL1 */
  /*    4284 */ 0x00000081UL, /* MODEM.ADCTRL2 */
  0x01054298UL, 0x0200003FUL, /* Write: MODEM.ADQUAL4 */
  /*    429C */ 0x0000FFFFUL, /* MODEM.ADQUAL5 */
  /*    42A0 */ 0x0000FFFFUL, /* MODEM.ADQUAL6 */
  /*    42A4 */ 0x000003FFUL, /* MODEM.ADQUAL7 */
  /*    42A8 */ 0x0000FFFFUL, /* MODEM.ADQUAL8 */
  0x010142B4UL, 0x00000000UL, /* Write: MODEM.ADFSM0 */
  0x010A4330UL, 0x01200040UL, /* Write: MODEM.ADPC1 */
  /*    4334 */ 0x000000A0UL, /* MODEM.ADPC2 */
  /*    4338 */ 0x01005008UL, /* MODEM.ADPC3 */
  /*    433C */ 0x1F1F1F1FUL, /* MODEM.ADPC4 */
  /*    4340 */ 0x1B1F1F1FUL, /* MODEM.ADPC5 */
  /*    4344 */ 0x11131518UL, /* MODEM.ADPC6 */
  /*    4348 */ 0x0C0D0E10UL, /* MODEM.ADPC7 */
  /*    434C */ 0x2F87C145UL, /* MODEM.ADPC8 */
  /*    4350 */ 0x00000000UL, /* MODEM.ADPC9 */
  /*    4354 */ 0x00000000UL, /* MODEM.ADPC10 */
  0x01018010UL, 0x00000003UL, /* Write: SYNTH.CTRL */
  0x0101803CUL, 0x00000001UL, /* Write: SYNTH.DIVCTRL */
  0x0101809CUL, 0x00000000UL, /* Write: SYNTH.LPFCTRL1CAL */
  0x010280B0UL, 0x02000300UL, /* Write: SYNTH.DSMCTRLRX */
  /*    80B4 */ 0x01000037UL, /* SYNTH.DSMCTRLTX */
  0x0201009CUL, 0x04000C00UL, /* Write: RAC.SYNTHREGCTRL */
  0x020300D8UL, 0xAA400005UL, /* Write: RAC.CLKMULTEN0 */
  /*    00DC */ 0x00000188UL, /* RAC.CLKMULTEN1 */
  /*    00E0 */ 0x000000C0UL, /* RAC.CLKMULTCTRL */
  0x020100F0UL, 0x0000012BUL, /* Write: RAC.IFADCTRIM1 */
  0x12010110UL, 0x000FFF00UL, /* AND: RAC.LNAMIXTRIM4 */
  0x32010110UL, 0x31000002UL, /* OR: RAC.LNAMIXTRIM4 */
  0x12010150UL, 0x0001C000UL, /* AND: RAC.PGACTRL */
  0x32010150UL, 0x00A200C1UL, /* OR: RAC.PGACTRL */
  0x02010174UL, 0x0C1BF169UL, /* Write: RAC.SYTRIM0 */
  0x12010178UL, 0x001C0000UL, /* AND: RAC.SYTRIM1 */
  0x32010178UL, 0xCFE00410UL, /* OR: RAC.SYTRIM1 */
  0x12010180UL, 0x00000779UL, /* AND: RAC.SYEN */
  0x32010180UL, 0x00000002UL, /* OR: RAC.SYEN */
  0x02010188UL, 0x00000050UL, /* Write: RAC.SYMMDCTRL */
  0xFFFFFFFFUL,
};

const uint32_t ble_viterbi1M_0_37_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_0, /* Write: SEQ.PHYINFO */
  0x00014010UL, 0x00004101UL, /* Write: FRC.MAXLENGTH */
  0x0001403CUL, 0x00000000UL, /* Write: FRC.FECCTRL */
  0x00014048UL, 0x030007A0UL, /* Write: FRC.CTRL */
  0x00014050UL, 0x00000000UL, /* Write: FRC.TRAILTXDATACTRL */
  0x0001405CUL, 0x00000000UL, /* Write: FRC.CONVGENERATOR */
  0x00014108UL, 0x00004CFFUL, /* Write: FRC.FCD0 */
  0x0007C054UL, 0x00301151UL, /* Write: AGC.GAINRANGE */
  /*    C058 */ 0xE609000EUL, /* AGC.AGCPERIOD0 */
  /*    C05C */ 0x0000002DUL, /* AGC.AGCPERIOD1 */
  /*    C060 */ 0x07060504UL, /* AGC.HICNTREGION0 */
  /*    C064 */ 0x00000008UL, /* AGC.HICNTREGION1 */
  /*    C068 */ 0x0002B6D1UL, /* AGC.STEPDWN */
  /*    C06C */ 0x00003564UL, /* AGC.GAINSTEPLIM0 */
  0x01074040UL, 0x51500000UL, /* Write: MODEM.AFCADJRX */
  /*    4044 */ 0x11A00000UL, /* MODEM.AFCADJTX */
  /*    4048 */ 0x00000010UL, /* MODEM.MIXCTRL */
  /*    404C */ 0x86000000UL, /* MODEM.CTRL0 */
  /*    4050 */ 0x0081C01FUL, /* MODEM.CTRL1 */
  /*    4054 */ 0x20000000UL, /* MODEM.CTRL2 */
  /*    4058 */ 0x00000000UL, /* MODEM.CTRL3 */
  0x01054064UL, 0x40000000UL, /* Write: MODEM.CTRL6 */
  /*    4068 */ 0x00F804B9UL, /* MODEM.TXBR */
  /*    406C */ 0x00000840UL, /* MODEM.RXBR */
  /*    4070 */ 0x00000002UL, /* MODEM.CF */
  /*    4074 */ 0x00040092UL, /* MODEM.PRE */
  0x010F4088UL, 0x003B03B7UL, /* Write: MODEM.MODINDEX */
  /*    408C */ 0xE0000000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x0D050200UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x53422F1CUL, /* MODEM.SHAPING1 */
  /*    409C */ 0x60686962UL, /* MODEM.SHAPING2 */
  /*    40A0 */ 0x1F2E4053UL, /* MODEM.SHAPING3 */
  /*    40A4 */ 0x08080A11UL, /* MODEM.SHAPING4 */
  /*    40A8 */ 0x06070808UL, /* MODEM.SHAPING5 */
  /*    40AC */ 0x03030405UL, /* MODEM.SHAPING6 */
  /*    40B0 */ 0x01020202UL, /* MODEM.SHAPING7 */
  /*    40B4 */ 0x01010101UL, /* MODEM.SHAPING8 */
  /*    40B8 */ 0x00000000UL, /* MODEM.SHAPING9 */
  /*    40BC */ 0x00000000UL, /* MODEM.SHAPING10 */
  /*    40C0 */ 0x00000000UL, /* MODEM.SHAPING11 */
  0x0101411CUL, 0x8CB16000UL, /* Write: MODEM.SRCCHF */
  0x0106413CUL, 0x005262F6UL, /* Write: MODEM.DIGMIXCTRL */
  /*    4140 */ 0x40985B05UL, /* MODEM.VITERBIDEMOD */
  /*    4144 */ 0x94826E8EUL, /* MODEM.VTCORRCFG0 */
  /*    4148 */ 0x5248781CUL, /* MODEM.VTCORRCFG1 */
  /*    414C */ 0x00403B89UL, /* MODEM.VTTRACK */
  /*    4150 */ 0x800003C0UL, /* MODEM.VTBLETIMING */
  0x0101415CUL, 0x0000DDFFUL, /* Write: MODEM.CGCLKSTOP */
  0x01074168UL, 0x00FA53E8UL, /* Write: MODEM.LONGRANGE */
  /*    416C */ 0x40000000UL, /* MODEM.LONGRANGE1 */
  /*    4170 */ 0x00000000UL, /* MODEM.LONGRANGE2 */
  /*    4174 */ 0x00000000UL, /* MODEM.LONGRANGE3 */
  /*    4178 */ 0x00000000UL, /* MODEM.LONGRANGE4 */
  /*    417C */ 0x00000000UL, /* MODEM.LONGRANGE5 */
  /*    4180 */ 0x00000000UL, /* MODEM.LONGRANGE6 */
  0x010341D0UL, 0xAA000000UL, /* Write: MODEM.TRECPMPATT */
  /*    41D4 */ 0x000000D0UL, /* MODEM.TRECPMDET */
  /*    41D8 */ 0x00120004UL, /* MODEM.TRECSCFG */
  0x011341E0UL, 0x00000000UL, /* Write: MODEM.COCURRMODE */
  /*    41E4 */ 0x0A00ABFFUL, /* MODEM.CHFCOE00 */
  /*    41E8 */ 0x000FF15CUL, /* MODEM.CHFCOE01 */
  /*    41EC */ 0x000241D3UL, /* MODEM.CHFCOE02 */
  /*    41F0 */ 0x00B1ED95UL, /* MODEM.CHFCOE03 */
  /*    41F4 */ 0x0FD87B19UL, /* MODEM.CHFCOE04 */
  /*    41F8 */ 0x04B90812UL, /* MODEM.CHFCOE05 */
  /*    41FC */ 0x1F6D1BEAUL, /* MODEM.CHFCOE06 */
  /*    4200 */ 0x0AC2B7C9UL, /* MODEM.CHFCOE10 */
  /*    4204 */ 0x003B200BUL, /* MODEM.CHFCOE11 */
  /*    4208 */ 0x00000643UL, /* MODEM.CHFCOE12 */
  /*    420C */ 0x00F36259UL, /* MODEM.CHFCOE13 */
  /*    4210 */ 0x00967E72UL, /* MODEM.CHFCOE14 */
  /*    4214 */ 0x00193DA7UL, /* MODEM.CHFCOE15 */
  /*    4218 */ 0x3BF122D0UL, /* MODEM.CHFCOE16 */
  /*    421C */ 0xA0000000UL, /* MODEM.CHFCTRL */
  /*    4220 */ 0x00000000UL, /* MODEM.CHFLATENCYCTRL */
  /*    4224 */ 0x00000038UL, /* MODEM.FRMSCHTIME */
  /*    4228 */ 0x00000000UL, /* MODEM.PREFILTCOEFF */
  0x0101424CUL, 0x04030008UL, /* Write: MODEM.PHDMODCTRL */
  0x01014268UL, 0x00000001UL, /* Write: MODEM.CHFSWCTRL */
  0x01018038UL, 0x001024C2UL, /* Write: SYNTH.IFFREQ */
  0x010280A0UL, 0x00037870UL, /* Write: SYNTH.LPFCTRL1RX */
  /*    80A4 */ 0x000000D0UL, /* SYNTH.LPFCTRL1TX */
  0x110180A8UL, 0x000001F0UL, /* AND: SYNTH.LPFCTRL2RX */
  0x310180A8UL, 0x01CB4205UL, /* OR: SYNTH.LPFCTRL2RX */
  0x110180ACUL, 0x000001F0UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x00FD3E05UL, /* OR: SYNTH.LPFCTRL2TX */
  0x120100ECUL, 0x00000FE0UL, /* AND: RAC.IFADCTRIM0 */
  0x320100ECUL, 0x5151200CUL, /* OR: RAC.IFADCTRIM0 */
  0x02010184UL, 0x00001000UL, /* Write: RAC.SYLOEN */
  0xFFFFFFFFUL,
};

